---
type: AddInCommandBinding
namespace: Autodesk.Revit.UI
version: 2024
members: 4
tags: [revit-api, class]
---

# AddInCommandBinding

`Autodesk.Revit.UI.AddInCommandBinding` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Event | BeforeExecuted | 2014 | `public event EventHandler < BeforeExecutedEventArgs > BeforeExecuted` |
| Event | CanExecute | 2013 | `public event EventHandler < CanExecuteEventArgs > CanExecute` |
| Event | Executed | 2013 | `public event EventHandler < ExecutedEventArgs > Executed` |
| Property | RevitCommandId | 2013 | `public RevitCommandId RevitCommandId { get ; }` |